#+toc: t
#+hugo_base_dir: ~/my_gits/hugo-sr/
#+hugo_section: docs
#+hugo_auto_set_lastmod: t
#+author: Shreyas Ragavan
#+hugo_tags: Emacs
#+hugo_categories: Emacs
#+hugo_menu: :menu "docs" :weight 2001
#+hugo_custom_front_matter: :linktitle Dotemacs :parent Emacs :toc true
#+hugo_draft: false
#+TITLE: My Emacs / Scimax configuration

* TODO Tangle org mode config on save
- Note taken on [2019-02-14 Thu 13:14] \\
  Need to add a condition of check: tangle if the file does not exist.

Source: https://thewanderingcoder.com/2015/02/literate-emacs-configuration/

This is a nice code snippet to automate the tangling on saving the config. This saves time while starting up Emacs...

#+BEGIN_SRC emacs-lisp
(defun sr/tangle-on-save-emacs-config-org-file()
  (interactive)
  (if (string= buffer-file-name (file-truename "~/scimax/user/sr-config.org"))
      (org-babel-tangle-file  "~/scimax/user/sr-config.org" "~/scimax/user/sr-config.el")
    )
  )

(defun sr/tangle-if-file-absent ()
  (interactive)
  (if nil  (file-exists-p "~/scimax/user/sr-config.el")
    (org-babel-tangle-file  "~/scimax/user/sr-config.org" "~/scimax/user/sr-config.el")
    )
  )
;; (add-hook 'after-save-hook 'sr/dotemacs-export)
(add-hook 'after-save-hook
          'sr/tangle-on-save-emacs-config-org-file)





#+END_SRC

#+RESULTS:
| git-gutter | flycheck-handle-save | t | sr/tangle-on-save-emacs-config-org-file |

*** Package list
Though the use-package approach is a lot more elegant, I also like to have a list of all my installed packages. In any case, this is more in line with my earlier configurations. As things evolve, I will probably shift completely to the use-package method.

#+begin_src emacs-lisp
(setq package-list '(diminish
                     ztree
                     org-gcal
                     w3m
                     org-trello
                     org-web-tools
                     auto-indent-mode
                     ob-sql-mode
                     dash
                     org-super-agenda
                     workgroups2
                     switch-window
                     ess
                     ess-R-data-view
                     interleave
                     deft
                     org-bookmark-heading
                     writeroom-mode
                     evil
                     evil-leader
                     polymode
                     poly-R
                     helm-ag
                     writegood-mode
                     artbollocks-mode
                     multiple-cursors
                     ox-reveal
                     better-defaults
                     jedi jedi-core
                     ag ein
                     ein-mumamo
                     ido-vertical-mode
                     company-jedi
                     conda
                     spacemacs-theme
                     elfeed-goodies
                     helpful
                     browse-kill-ring
                     ivy-yasnippet
                     speed-type
                     clojure-mode
                     cider
                     helm-dash
                     org-projectile
                     bash-completion
                     elmacro
                     helm-org-rifle
                     sx define-word))
#+end_src

#+RESULTS:
| diminish | org-journal | ztree | org-gcal | w3m | org-trello | org-web-tools | auto-indent-mode | ob-sql-mode | dash | org-super-agenda | workgroups2 | switch-window | ess | ess-R-data-view | interleave | deft | org-bookmark-heading | writeroom-mode | evil | evil-leader | polymode | poly-R | helm-ag | writegood-mode | artbollocks-mode | multiple-cursors | ox-reveal | better-defaults | jedi | jedi-core | ag | ein | ein-mumamo | ido-vertical-mode | company-jedi | conda | spacemacs-theme | elfeed-goodies | helpful | browse-kill-ring | ivy-yasnippet | speed-type | clojure-mode | cider | helm-dash | org-projectile | bash-completion | elmacro | helm-org-rifle | sx | define-word |

** TEST Export async
- Note taken on [2019-02-14 Thu 16:03] \\
  This requires a separate init file to be setup that enables Emacs to launch a separate process to export large files. It would be better as a vanilla emacs file.

#+BEGIN_SRC emacs-lisp :tangle no
(setq org-export-async-init-file
      (expand-file-name "async-export.el" user-emacs-directory)
      )
#+END_SRC

#+RESULTS:
: /Users/shreyas/scimax/user/async-export.el

* Dired

Source: https://github.com/angrybacon/dotemacs/blob/master/dotemacs.org

#+BEGIN_SRC emacs-lisp
(use-package dired
  :ensure nil
  :delight dired-mode "Dired"
  :preface
  (defun me/dired-directories-first ()
    "Sort dired listings with directories first before adding marks."
    (save-excursion
      (let (buffer-read-only)
        (forward-line 2)
        (sort-regexp-fields t "^.*$" "[ ]*." (point) (point-max)))
      (set-buffer-modified-p nil)))
  ;:hook ;(dired-mode . dired-hide-details-mode)
  :config
  (advice-add 'dired-readin :after #'me/dired-directories-first)
  (setq-default
   dired-auto-revert-buffer t
   dired-dwim-target t
   dired-hide-details-hide-symlink-targets nil
   dired-listing-switches "-alh"
   dired-ls-F-marks-symlinks nil
   dired-recursive-copies 'always))

(use-package dired-x
  :ensure nil
  :preface
  (defun me/dired-revert-after-command (command &optional output error)
    (revert-buffer))
  :config
  (advice-add 'dired-smart-shell-command :after #'me/dired-revert-after-command))

(message "Loaded Dired customisation")
#+END_SRC

#+RESULTS:
: Loaded Dired customisation

* Swiper
:PROPERTIES:
:ID:       22EF84BD-97F8-488A-8E3A-2FF28D0A0F57
:END:
- Note taken on [2019-02-07 Thu 16:50] \\
  I use swiper for a general search. However [[id:3F1BAD63-98A3-4BF0-B5DD-67ED63D0AFEB][helm-swoop]] is awesome.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-s") 'swiper)
(setq ivy-display-style 'fancy)

;; advise swiper to recenter on exit
(defun bjm-swiper-recenter (&rest args)
  "recenter display after swiper"
  (recenter)
  )
(advice-add 'swiper :after #'bjm-swiper-recenter)

(message "Loaded Swiper customisation")
#+END_SRC

#+RESULTS:
: Loaded Swiper customisation

** Main configuration

#+begin_src emacs-lisp
(use-package ess
  :ensure t
  :defer t
  :config
  (require 'ess)
  (setq ess-describe-at-point-method nil)
  (setq ess-switch-to-end-of-proc-buffer t)
  (setq ess-rutils-keys +1)
  (setq ess-eval-visibly 'nil)
  (setq ess-use-flymake +1)
  (setq ess-use-company t)
  (setq ess-history-file "~/.Rhistory")
  (setq ess-use-ido t)
  (setq ess-roxy-hide-show-p t)
  (speedbar-add-supported-extension ".R")
  (setq comint-scroll-to-bottom-on-input t)
  (setq comint-scroll-to-bottom-on-output t)
  (setq comint-move-point-for-output t)
  )

(require 'ess-R-data-view)
(require 'ess-rutils)

(use-package ess-view
  :ensure t
  :defer t
  :config
  (if (system-type-is-darwin)
      (setq ess-view--spreadsheet-program
            "/Applications/Tad.app/Contents/MacOS/Tad"
            )
    )
  (if (system-type-is-gnu)
      (setq ess-view--spreadsheet-program
            "tabview"
            )
    )
  )


(message "Loaded ESS configuration")
            #+end_src

            #+RESULTS:
            : Loaded ESS configuration

** ESS Buffer display Config

Setting buffer display setting for ESS, similar to Rstudio. This is taken from the ESS Manual. This seems most convenient as of now.

#+BEGIN_SRC emacs-lisp

(setq display-buffer-alist
      `(("*R Dired"
         (display-buffer-reuse-window display-buffer-in-side-window)
         (side . right)
         (slot . -1)
         (window-width . 0.33)
         (reusable-frames . nil))
        ("*R"
         (display-buffer-reuse-window display-buffer-at-bottom)
         (window-width . 0.35)
         (reusable-frames . nil))
        ("*Help"
         (display-buffer-reuse-window display-buffer-in-side-window)
         (side . right)
         (slot . 1)
         (window-width . 0.33)
         (reusable-frames . nil))))

#+END_SRC

#+RESULTS:
| *R Dired | (display-buffer-reuse-window display-buffer-in-side-window) | (side . right)        | (slot . -1)       | (window-width . 0.33) | (reusable-frames) |
| *R       | (display-buffer-reuse-window display-buffer-at-bottom)      | (window-width . 0.35) | (reusable-frames) |                       |                   |
| *Help    | (display-buffer-reuse-window display-buffer-in-side-window) | (side . right)        | (slot . 1)        | (window-width . 0.33) | (reusable-frames) |

** TODO Setting custom keywords with fast access
- Note taken on [2019-02-12 Tue 12:19] \\
  This requires a complete reload of org to come in effect.

#+BEGIN_SRC emacs-lisp
(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "CANCEL(c)" "POSTPONED(p)" "|" "DONE(d)" "STABLE(s)")
        (sequence "TEST(T)" "BUG(b)" "KNOWNCAUSE(k)" "|" "FIXED(f)")
        (sequence "|" )))
#+END_SRC

#+RESULTS:
| sequence | TODO(t) | NEXT(n) | CANCEL(c)     | POSTPONED(p) |   |          | DONE(d) | STABLE(s) |
| sequence | TEST(T) | BUG(b)  | KNOWNCAUSE(k) |              |   | FIXED(f) |         |           |
| sequence |         |         |               |              |   |          |         |           |

*** DONE org-habit
CLOSED: [2019-02-12 Tue 13:21]
- Note taken on [2019-02-12 Tue 13:20] \\
  Adding a require has brought org-habit back on track.
- Note taken on [2019-02-07 Thu 09:50] \\
  Appears the use-package config for org-habit is not correct and there is some issue in downloading it as a package.

I want to shift the org habit graph in the agenda further out right so as to leave enough room for the headings to be visible.

#+begin_src emacs-lisp
(require 'org-habit)
(setq org-habit-graph-column 90)
#+end_src

#+RESULTS:
: 90

*** Capture templates

#+begin_src emacs-lisp
(setq org-capture-templates
      '(("t" "Task entry")
        ("tt" "Todo - Fast" entry (file+headline "~/my_org/todo-global.org" "@Inbox")
	 "** TODO %?")
        ("tb" "Todo -BGR" entry (file+headline "~/my_org/bgr.org" "#BGR #Inbox")
	 "** TODO %?")
        ("te" "Todo - Emacs" entry (file+headline "~/my_org/todo-global.org" "@Emacs notes and tasks")
         "** TODO %?")
        ("td" "Datascience inbox" entry (file+headline "~/my_org/datascience.org" "@Datascience @Inbox")
         "** TODO %?")
	("tm" "Mail Link Todo" entry (file+headline "~/my_org/todo-global.org" "@Inbox")
	 "** TODO Mail: %a ")
        ("l" "Link/Snippet" entry (file+headline "~/my_org/link_database.org" ".UL Unfiled Links")
         "** %? %a ")
        ("e" "Protocol info" entry ;; 'w' for 'org-protocol'
         (file+headline "~/my_org/link_database.org" ".UL Unfiled Links")
         "*** %a, \n %:initial")
        ("n" "Notes")
        ("ne" "Emacs note" entry (file+headline "~/my_org/todo-global.org" "@Emacs notes and tasks")
         "** %?\n:PROPERTY:\n:CREATED: [%<%Y-%m-%d %a %H:%M>]\n:END:")
        ("nn" "General note" entry (file+headline "~/my_org/notes.org" "@NOTES")
         "** %?\n:PROPERTY:\n:CREATED: [%<%Y-%m-%d %a %H:%M>]\n:END:")
        ("nd" "Datascience note" entry (file+headline "~/my_org/datascience.org" "@Datascience @Notes")
         "** %?")
        ("b" "BGR stuff")
        ("bi" "Inventory project")
        ("bil" "Daily log" entry (file+olp+datetree "~/my_org/bgr.org" "Inventory management Project") "** %? %i")
        ("C" "Commandment" entry (file+datetree "~/my_org/lifebook.org" "")
         "** %? %i :commandment:")
        ("J" "Job search" entry (file+headline "~/my_org/mrps_canjs.org" "MRPS #CANJS")
         "** TODO %? %i ")
        ("r" "Self Reflection" entry (file+datetree "~/my_org/lifebook.org" "")
         "b** %? %i :self_reflection:")
        ("w" "Website" plain
         (function org-website-clipper)
         "* %a %T\n" :immediate-finish t)
        ("j" "Journal entry" entry (function org-journal-find-location)
         "* %(format-time-string org-journal-time-format) %?")
        ("i" "Whole article capture" entry
         (file+headline "~/my_org/full_article_archive.org" "" :empty-lines 1)
         "** %a, %T\n %:initial" :empty-lines 1)
        ("c" "Clocking capture")
        ("ct" "Clock TODO" entry (clock) "** TODO %?")
        ("cn" "Clock Note" entry (clock) "** %?\n:PROPERTY:\n:CREATED: [%<%Y-%m-%d %a %H:%M>]\n:END:")
        ))
#+end_src

#+RESULTS:
| t  | Task entry        |       |                                                                |                  |
| tt | Todo - Fast       | entry | (file+headline ~/my_org/todo-global.org @Inbox)                 | ** TODO %?       |
| tb | Todo -BGR         | entry | (file+headline ~/my_org/bgr.org #BGR #Inbox)                    | ** TODO %?       |
| te | Todo - Emacs      | entry | (file+headline ~/my_org/todo-global.org @Emacs notes and tasks) | ** TODO %?       |
| td | Datascience inbox | entry | (file+headline ~/my_org/datascience.org @Datascience @Inbox)    | ** TODO %?       |
| tm | Mail Link Todo    | entry | (file+headline ~/my_org/todo-global.org @Inbox)                 | ** TODO Mail: %a |
| l  | Link/Snippet      | entry | (file+headline ~/my_org/link_database.org .UL Unfiled Links)     | ** %? %a         |
| e  | Protocol info     | entry | (file+headline ~/my_org/link_database.org .UL Unfiled Links)     | *** %a,            |

**** Advising clock Out

#+BEGIN_SRC emacs-lisp
(defun sr/clock-out-maybe ()
  (when (and sr/keep-clock-running
             (not org-clock-clocking-in)
             (marker-buffer org-clock-default-task)
             (not org-clock-resolving-clocks-due-to-idleness))
    (sr/clock-in-organization-task-as-default)))

(add-hook 'org-clock-out-hook 'sr/clock-out-maybe 'append)
#+END_SRC

#+RESULTS:
| org-clock-remove-empty-clock-drawer | sr/clock-out-maybe |

** Setting sources for helm
- Note taken on [2019-03-04 Mon 15:49] \\
  The scimax hotspots can be customised with an improved function that only requires commands locations to be separately defined. This resolved the helm-recentf problem.
- Note taken on [2019-02-12 Tue 14:55] \\
  This is still causing issues: the recentf list has to be cleared via helm-mini first.
- Note taken on [2019-02-07 Thu 16:28] \\
  This was needed as it seems helm was not sourcing from recentf file lists. With this source list defined, it provides options to choose from recent files, bookmarks, open buffers.

As an example: setting these sources enables my bookmarks to be available along with my buffers, enabling a jump to either.

#+BEGIN_SRC emacs-lisp
(setq helm-mini-default-sources '(helm-source-buffers-list
                                  helm-source-recentf
                                  helm-source-bookmarks
                                  helm-source-bookmark-set
                                  helm-source-buffer-not-found))

(setq helm-buffers-list-default-sources '(helm-source-buffers-list
                                          helm-source-recentf
                                          helm-source-bookmarks
                                          helm-source-bookmark-set
                                          helm-source-buffer-not-found))

#+END_SRC

#+RESULTS:
| helm-source-buffers-list | helm-source-recentf | helm-source-bookmarks | helm-source-bookmark-set | helm-source-buffer-not-found |

** Replacing flycheck with flymake
This is especially for python modules at the moment.

#+BEGIN_SRC emacs-lisp
(when (require 'flycheck nil t)
  (setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
  (add-hook 'elpy-mode-hook 'flycheck-mode))
#+END_SRC

#+RESULTS:
| flymake-mode | poly-r-mode-setup | ess-S-mouse-me-menu-commands | ess-r-setup-flymake |

** Emacsclient or frame specific settings
Since I run emacs as a daemon and call the emacsclient, the background has to be set for new frames. Additionally, I'd like the frames to launch full screen.

#+begin_src emacs-lisp
(setq default-frame-alist
      '((background-color . "whitesmoke")
        (foreground-color . "black")
        (fullscreen . maximized)
        ))
        #+end_src

        #+RESULTS:
        : ((fullscreen . maximized))

** visual-fill-column
Source: https://github.com/wasamasa/dotemacs/blob/master/init.org

Adding a hook to enable visual fill column mode once visual line mode is called did not work for me. The issue is that this is called

#+BEGIN_SRC emacs-lisp
(setq
 global-visual-line-mode 1
 fill-column 80)
#+END_SRC

#+RESULTS:
: 80

* LOB

There are a bunch of scripts that I would like ingested into the Library of Babel to be available for ready use. In some cases, with specific and relatively simple actions these are useful, and generally easier to define that Emacs Functions.

#+BEGIN_SRC emacs-lisp
(org-babel-lob-ingest "~/my_projects/sr-snip-lob/README.org")
#+END_SRC

#+RESULTS:
: 4

** Scimax Hotspots

#+begin_src emacs-lisp
(setq scimax-user-hotspot-commands
      '(("Agenda All" . (lambda () (org-agenda "" "a")))
        ("Agenda Office" . (lambda () (org-agenda "" "o")))
	("Mail" . (lambda ()
                    (if (get-buffer "*mu4e-headers*")
                        (progn
                          (switch-to-buffer "*mu4e-headers*")
                          (delete-other-windows))
                      (mu4e))))
        ("Bookmarks" . (lambda () (helm-source-bookmarks)))
        ("Reload Scimax babel" . (lambda () (org-babel-load-file (expand-file-name "sr-config.org" user-emacs-directory))))
        )
      )

(setq scimax-user-hotspot-locations
      '(
        ("CV Org" . "~/org_cv/CV_Shreyas_Ragavan.org")
        ("scd - scimax dir" . "~/scimax/" )
        ("scu - scimax user dir" . "~/scimax/user/")
        ( "sco - scimax org conf" . "~/scimax/user/sr-config.org")
        ("blog" . "~/my_org/blog-book.org")
	("github" . "~/my_gits/")
        ("project" . "~/my_projects/")
        ("cheatsheet" . "~/my_cheatsheets/")
        ("passwords" . "~/my_org/secrets.org.gpg")
        ("references" . "~/Dropbox/bibliography/references.bib")
        )
      )
#+end_src

#+RESULTS:
: ((CV Org . ~/org_cv/CV_Shreyas_Ragavan.org) (scd - scimax dir . ~/scimax/) (scu - scimax user dir . ~/scimax/user/) (sco - scimax org conf . ~/scimax/user/sr-config.org) (blog . ~/my_org/blog-book.org) (github . ~/my_gits/) (project . ~/my_projects/) (cheatsheet . ~/my_cheatsheets/) (passwords . ~/my_org/secrets.org.gpg) (references . ~/Dropbox/bibliography/references.bib))

** TODO Exporting org projects
#+BEGIN_SRC emacs-lisp :tangle no
(
 setq org-publish-project-alist
 '(
   ("org-repo"
    :base-directory "./"
    :base-extension "org"
    :publishing-directory "/Users/shreyas/my_projects/dotemacs"
    :EXPORT_FILE_NAME "README.org"
    :recursive f
    :publishing-function org-html-publish-to-html
    ;; :html-head "<link rel="stylesheet" href="http://dakrone.github.io/org2.css" type="text/css" />"
    )

   ("md"
    :base-directory "./"
    :base-extension "org"
    :publishing-directory "./export/"
    :recursive t
    :publishing-function org-md-export-to-markdown
    )

   ("Documentation - html + md"
    :components ("html-static" "md" )
    )))
#+END_SRC

#+RESULTS:
| org-repo                  | :base-directory | ./               | :base-extension | org | :publishing-directory | /Users/shreyas/my_projects/dotemacs | :EXPORT_FILE_NAME | README.org | :recursive           | f                         | :publishing-function | org-html-publish-to-html |
| md                        | :base-directory | ./               | :base-extension | org | :publishing-directory | ./export/                          | :recursive      | t          | :publishing-function | org-md-export-to-markdown |                      |                          |
| Documentation - html + md | :components     | (html-static md) |                 |     |                       |                                    |                 |            |                      |                           |                      |                          |

* TODO mu4e
- Note taken on [2019-02-12 Tue 14:53] \\
  The use-package documentation specifies a method to do this via use-package itself, without enclosing the whole snippet within a if clause.
- Note taken on [2019-02-07 Thu 20:43] \\
  The mu4e config has to be broken down and the send email with htmlize has to be evaluated.
- Note taken on [2019-02-07 Thu 09:04] \\
  As of now, I do not acess my email on different computers via Emacs. The end goal is to setup a mail server via VPS and store my email online, which can then be searched via Emacs and mu4e from any location.

#+BEGIN_SRC emacs-lisp
(if (system-type-is-darwin)
    (progn
      (use-package mu4e
        :ensure nil
        :config
        (require 'mu4e)
        (require 'mu4e-contrib)
        (require 'org-mu4e)

        (setq
         mue4e-headers-skip-duplicates  t
         mu4e-view-show-images t
         mu4e-view-show-addresses 't
         mu4e-compose-format-flowed nil
         mu4e-update-interval 200
         message-ignored-cited-headers 'nil
         mu4e-date-format "%y/%m/%d"
         mu4e-headers-date-format "%Y/%m/%d"
         mu4e-change-filenames-when-moving t
         mu4e-attachments-dir "~/Downloads/Mail-Attachments/"
         mu4e-maildir (expand-file-name "~/my_mail/fmail")
         )

        ;; mu4e email refiling loations
        (setq
         mu4e-refile-folder "/Archive"
         mu4e-trash-folder  "/Trash"
         mu4e-sent-folder   "/Sent"
         mu4e-drafts-folder "/Drafts"
         )

        ;; setup some handy shortcuts
        (setq mu4e-maildir-shortcuts
              '(("/INBOX"   . ?i)
	        ("/Sent"    . ?s)
	        ("/Archive" . ?a)
	        ("/Trash"   . ?t)))

        ;;store link to message if in header view, not to header query
        (setq org-mu4e-link-query-in-headers-mode nil
              org-mu4e-convert-to-html t) ;; org -> html

        ;; Enabling view in browser for HTML heavy emails that don't render well
        (add-to-list 'mu4e-view-actions
	             '("ViewInBrowser" . mu4e-action-view-in-browser) t)

        (autoload 'mu4e "mu4e" "mu for Emacs." t)

        ;; Config for sending email
        (setq
         message-send-mail-function 'message-send-mail-with-sendmail
         send-mail-function 'sendmail-send-it
         message-kill-buffer-on-exit t
         )

        ;; allow for updating mail using 'U' in the main view:
        (setq mu4e-get-mail-command  "mbsync -a -q")

        ;; Don't keep asking for confirmation for every action
        (defun my-mu4e-mark-execute-all-no-confirm ()
          "Execute all marks without confirmation."
          (interactive)
          (mu4e-mark-execute-all 'no-confirm))
        ;; mapping x to above function
        (define-key mu4e-headers-mode-map "x" #'my-mu4e-mark-execute-all-no-confirm)
        )
      ;; source: http://matt.hackinghistory.ca/2016/11/18/sending-html-mail-with-mu4e/

      ;; this is stolen from John but it didn't work for me until I
      ;; made those changes to mu4e-compose.el
      (defun htmlize-and-send ()
        "When in an org-mu4e-compose-org-mode message, htmlize and send it."
        (interactive)
        (when
            (member 'org~mu4e-mime-switch-headers-or-body post-command-hook)
          (org-mime-htmlize)
          (org-mu4e-compose-org-mode)
          (mu4e-compose-mode)
          (message-send-and-exit)))

      ;; This overloads the amazing C-c C-c commands in org-mode with one more function
      ;; namely the htmlize-and-send, above.
      (add-hook 'org-ctrl-c-ctrl-c-hook 'htmlize-and-send t)
      )
  )
#+END_SRC

#+RESULTS:
| scimax-radio-CcCc | htmlize-and-send |
